app/controllers/api/v1/auth_controller.rb

            def register
                user = User.new(user_params)
                if User.exists?(email: user_params[:email])
                    render json: { error: 'This email address has already been registered, please login or select a different address.' }, status: :unprocessable_entity
                elsif user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'rioriorio@rio.rio' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'rio2@rio2.rio2' LIMIT 1
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "move_in_date") VALUES ('rio2@rio2.rio2', '$2a$12$SZoe3aFaRPmqRUZJ5ScMFu/UySFhwY9ZCAro/YMLwGDFSU0MHcdgC', '2024-12-30 04:33:38.645618', '2024-12-30 04:33:38.645618', NULL) RETURNING "id"

            def authorize_request
                header = request.headers['Authorization']
                header = header.split(' ').last if header
                begin
                    decoded = JsonWebToken.decode(header)
                    @current_user = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1