app/controllers/api/v1/users_controller.rb

            def create
                user = User.new(user_params)

                if User.exists?(email: user_params[:email])
                    render json: { error: 'Email is already taken' }, status: :unprocessable_entity
                elsif user.save
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'riorio@mailbox.org' LIMIT 1
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "move_in_date") VALUES ('riorioriorio@rio.rio', '$2a$12$/u3UQcc/2t46B8MrPxzeQ.kVNwngXeVhDYJ4etRud2Cowsn0MyIum', '2024-12-30 03:34:34.593446', '2024-12-30 03:34:34.593446', NULL) RETURNING "id"

            def update_move_in_date
                if @user.update(move_in_date: params[:move_in_date])
---
UPDATE "users" SET "updated_at" = '2024-12-30 04:01:07.108473', "move_in_date" = '0005-04-21' WHERE "users"."id" = 2

            def authorize_request
                header = request.headers['Authorization']
                header = header.split(' ').last if header
                decoded = JsonWebToken.decode(header)
                @current_user = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1